app/controllers/venues_controller.rb

SELECT * FROM "venues"
---
    def index
      respond_with(@venues = Venue.all)

INSERT INTO "venues" ("name", "city", "updated_at", "country", "address", "source", "state", "created_at") VALUES('9B', 'Miami', '2009-09-02 20:44:50.212986', 'USA', '900 Biscayne', 'boty', 'FL', '2009-09-02 20:44:50.212986')
---
    def create
      respond_with(@venue = Venue.create(params[:user]))

SELECT * FROM "venues" WHERE ("venues"."id" = 1)
---
    def edit
      respond_with(@venue = Venue.find(params[:id]))